app/views/instructor/courses/show.html.erb

SELECT "sections".* FROM "sections" WHERE "sections"."course_id" = $1  [["course_id", 43]]
---
  <ul>
  <% current_course.sections.each do |section| %>

SELECT "lessons".* FROM "lessons" WHERE "lessons"."section_id" = $1 ORDER BY "lessons"."row_order" ASC  [["section_id", 39]]
---
      <ul>
        <% section.lessons.rank(:row_order).each do |lesson| %>