app/controllers/instructor/courses_controller.rb

INSERT INTO "courses" ("title", "description", "cost", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Java class"], ["description", "Jr class"], ["cost", "0.0"], ["user_id", 1], ["created_at", "2019-08-23 18:14:58.450376"], ["updated_at", "2019-08-23 18:14:58.450376"]]
---
  def create
    @course = current_user.courses.create(course_params)

SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def current_course
    @current_course ||= Course.find(params[:id])