app/controllers/instructor/lessons_controller.rb

def create
  @lesson = current_section.lessons.create(lesson_params)
---
INSERT INTO "lessons" ("title", "subtitle", "section_id", "created_at", "updated_at", "row_order") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "title"], ["subtitle", "subtitle"], ["section_id", 39], ["created_at", "2019-09-01 16:00:19.778879"], ["updated_at", "2019-09-01 16:00:19.778879"], ["row_order", 1073741824]]

def current_section
  @current_section ||= Section.find(params[:section_id])
---
SELECT  "sections".* FROM "sections" WHERE "sections"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]