app/controllers/instructor/sections_controller.rb

  def create
    @section = current_course.sections.create(section_params)
---
INSERT INTO "sections" ("title", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Yeet"], ["course_id", 4], ["created_at", "2019-08-23 20:06:10.684369"], ["updated_at", "2019-08-23 20:06:10.684369"]]

  def update
    @section = current_course.sections.create(section_params)
---
INSERT INTO "sections" ("title", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "section"], ["course_id", 1], ["created_at", "2019-08-30 20:57:20.701282"], ["updated_at", "2019-08-30 20:57:20.701282"]]

  def current_course
    @current_course ||= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]