app/controllers/instructor/sections_controller.rb

  def current_course
    @current_course ||= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]