app/controllers/enrollments_controller.rb

  def create
		if current_course.premium?
		    # Amount in cents
				@amount = (current_course.cost * 100).to_i

				customer = Stripe::Customer.create(
					email: params[:stripeEmail],
					source: params[:stripeToken]
				)

				charge = Stripe::Charge.create(
					customer: customer.id,
					amount: @amount,
					description: 'Premium Flixter Content',
					currency: 'usd'
				)
			end

		current_user.enrollments.create(course: current_course)
---
INSERT INTO "enrollments" ("user_id", "course_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 1], ["course_id", 1], ["created_at", "2019-08-30 20:15:42.000200"], ["updated_at", "2019-08-30 20:15:42.000200"]]

	def current_course
		@current_course ||= Course.find(params[:course_id])
---
SELECT  "courses".* FROM "courses" WHERE "courses"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]